Schlatter076/EMB-BL-ccm-xx-C/Libs/tsPeriph/FF_3rdPty/NRF51_52fwlib/standard_Libs/CMSIS/util/src/app_error_weak.c
/**
 * Copyright (c) 2016 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "../inc/app_error.h"
#include "../inc/app_util_platform.h"

#include "../../../../libraries/log/inc/nrf_log.h"
#include "../../../../libraries/log/inc/nrf_log_ctrl.h"
#include "../../../../libraries/strerror/nrf_strerror.h"

#if defined(SOFTDEVICE_PRESENT)
#include "../../../nrf51_52_StdPeriph_Driver/nrf/inc/nrf_sdm.h"
#endif

/*lint -save -e14 */
/**
 * Function is implemented as weak so that it can be overwritten by custom application error handler
 * when needed.
 */
__WEAK void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
#if (0)
  __disable_irq();
  NRF_LOG_FINAL_FLUSH();

#ifndef DEBUG
  NRF_LOG_ERROR("Fatal error");
#else
  switch (id)
  {
#if defined(SOFTDEVICE_PRESENT) && SOFTDEVICE_PRESENT
    case NRF_FAULT_ID_SD_ASSERT:
      NRF_LOG_ERROR("SOFTDEVICE: ASSERTION FAILED");
      break;
    case NRF_FAULT_ID_APP_MEMACC:
      NRF_LOG_ERROR("SOFTDEVICE: INVALID MEMORY ACCESS");
      break;
#endif
    case NRF_FAULT_ID_SDK_ASSERT:
    {
      assert_info_t * p_info = (assert_info_t *)info;
      NRF_LOG_ERROR("ASSERTION FAILED at %s:%u",
          p_info->p_file_name,
          p_info->line_num);
      break;
    }
    case NRF_FAULT_ID_SDK_ERROR:
    {
      error_info_t * p_info = (error_info_t *)info;
      NRF_LOG_ERROR("ERROR %u [%s] at %s:%u\r\nPC at: 0x%08x",
          p_info->err_code,
          nrf_strerror_get(p_info->err_code),
          p_info->p_file_name,
          p_info->line_num,
          pc);
      NRF_LOG_ERROR("End of error report");
      break;
    }
    default:
      NRF_LOG_ERROR("UNKNOWN FAULT at 0x%08X", pc);
      break;
  }
#endif

  NRF_BREAKPOINT_COND;
  // On assert, the system can only recover with a reset.

#ifndef DEBUG
  NRF_LOG_WARNING("System reset");
  NVIC_SystemReset();
#else
  app_error_save_and_stop(id, pc, info);
#endif // DEBUG
#else
  while(1);
#endif
}
/*lint -restore */
